EXPLAIN ANALYZE SELECT "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД", "Н_ВЕДОМОСТИ"."ДАТА"
FROM "Н_ТИПЫ_ВЕДОМОСТЕЙ"
RIGHT JOIN "Н_ВЕДОМОСТИ" ON "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД" = "Н_ВЕДОМОСТИ"."ТВ_ИД"
WHERE "НАИМЕНОВАНИЕ" = 'Перезачет' AND
      "Н_ВЕДОМОСТИ"."ИД" < 1426978 AND
      "Н_ВЕДОМОСТИ"."ИД" < 1250981;

EXPLAIN ANALYZE SELECT "Н_ЛЮДИ"."ОТЧЕСТВО"
FROM "Н_ЛЮДИ"
LEFT JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
LEFT JOIN "Н_СЕССИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ИД" < 163484 AND
      "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 163249;
